# 580. Count Student Number in Departments

 A university uses 2 data tables, student and department, to store data about its students and the departments associated with each major.

Write a query to print the respective department name and number of students majoring in each department for all departments in the department table (even ones with no current students).

Sort your results by descending number of students; if two or more departments have the same number of students, then sort those departments alphabetically by department name.

The student is described as follow:

Column Name	Type
student_id	Integer
student_name	String
gender	Character
dept_id	Integer
where student_id is the student’s ID number, student_name is the student’s name, gender is their gender, and dept_id is the department ID associated with their declared major.

And the department table is described as below:

Column Name	Type
dept_id	Integer
dept_name	String
where dept_id is the department’s ID number and dept_name is the department name.

Here is an example input:
student table:

student_id	student_name	gender	dept_id
1	        Jack	        M	     1
2	        Jane	        F        1
3	        Mark	        M	     2
department table:

dept_id	dept_name
1	    Engineering
2	    Science
3	    Law
The Output should be:

dept_name	student_number
Engineering	  2
Science    	  1
Law	          0

In [2]:
import pandas as pd
import re
import numpy as np
student= pd.DataFrame({'student_id':[1,2,3],'student_name':['Jack','Jane','Mark'],'gender':['M','F','M'],'dept_id':[1,1,2]})
student=student[['student_id','student_name','gender','dept_id']]
student

   student_id student_name gender  dept_id
0           1         Jack      M        1
1           2         Jane      F        1
2           3         Mark      M        2

In [4]:
department= pd.DataFrame({'dept_id':[1,2,3],'dept_name':['Engineering','Science','Law']})
department=department[['dept_id','dept_name']]
department

   dept_id    dept_name
0        1  Engineering
1        2      Science
2        3          Law

In [13]:
s1=student.groupby('dept_id').size().to_frame('number').reset_index()
s1

   dept_id  number
0        1       2
1        2       1

In [14]:
output=pd.merge(department,s1,on='dept_id',how='left')
output

   dept_id    dept_name  number
0        1  Engineering     2.0
1        2      Science     1.0
2        3          Law     NaN

In [15]:
output1=output.replace('nan', np.nan).fillna(0)
output1

   dept_id    dept_name  number
0        1  Engineering     2.0
1        2      Science     1.0
2        3          Law     0.0

In [17]:
output1['student_number']=output1.number.astype(int)

In [19]:
print(output1[['dept_name','student_number']].to_string(index=False))

dept_name  student_number
Engineering               2
    Science               1
        Law               0